CSI API ETABS v1

# cAutoSeismicGetASCE716 Method

---

Retrieves auto seismic loading parameters for the 2016 ASCE 7 code

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetASCE716(
    	string Name,
    	ref bool[] nDir,
    	ref double Eccen,
    	ref int PeriodFlag,
    	ref int CtType,
    	ref double UserT,
    	ref bool UserZ,
    	ref double TopZ,
    	ref double BottomZ,
    	ref double R,
    	ref double Omega,
    	ref double Cd,
    	ref double I,
    	ref double Ss,
    	ref double S1,
    	ref double TL,
    	ref int SiteClass,
    	ref double Fa,
    	ref double Fv
    )

    Function GetASCE716 (
    	Name As String,
    	ByRef nDir As Boolean(),
    	ByRef Eccen As Double,
    	ByRef PeriodFlag As Integer,
    	ByRef CtType As Integer,
    	ByRef UserT As Double,
    	ByRef UserZ As Boolean,
    	ByRef TopZ As Double,
    	ByRef BottomZ As Double,
    	ByRef R As Double,
    	ByRef Omega As Double,
    	ByRef Cd As Double,
    	ByRef I As Double,
    	ByRef Ss As Double,
    	ByRef S1 As Double,
    	ByRef TL As Double,
    	ByRef SiteClass As Integer,
    	ByRef Fa As Double,
    	ByRef Fv As Double
    ) As Integer

    Dim instance As cAutoSeismic
    Dim Name As String
    Dim nDir As Boolean()
    Dim Eccen As Double
    Dim PeriodFlag As Integer
    Dim CtType As Integer
    Dim UserT As Double
    Dim UserZ As Boolean
    Dim TopZ As Double
    Dim BottomZ As Double
    Dim R As Double
    Dim Omega As Double
    Dim Cd As Double
    Dim I As Double
    Dim Ss As Double
    Dim S1 As Double
    Dim TL As Double
    Dim SiteClass As Integer
    Dim Fa As Double
    Dim Fv As Double
    Dim returnValue As Integer

    returnValue = instance.GetASCE716(Name,
    	nDir, Eccen, PeriodFlag, CtType, UserT,
    	UserZ, TopZ, BottomZ, R, Omega, Cd,
    	I, Ss, S1, TL, SiteClass, Fa, Fv)

    int GetASCE716(
    	String^ Name,
    	array<bool>^% nDir,
    	double% Eccen,
    	int% PeriodFlag,
    	int% CtType,
    	double% UserT,
    	bool% UserZ,
    	double% TopZ,
    	double% BottomZ,
    	double% R,
    	double% Omega,
    	double% Cd,
    	double% I,
    	double% Ss,
    	double% S1,
    	double% TL,
    	int% SiteClass,
    	double% Fa,
    	double% Fv
    )

    abstract GetASCE716 :
            Name : string *
            nDir : bool[] byref *
            Eccen : float byref *
            PeriodFlag : int byref *
            CtType : int byref *
            UserT : float byref *
            UserZ : bool byref *
            TopZ : float byref *
            BottomZ : float byref *
            R : float byref *
            Omega : float byref *
            Cd : float byref *
            I : float byref *
            Ss : float byref *
            S1 : float byref *
            TL : float byref *
            SiteClass : int byref *
            Fa : float byref *
            Fv : float byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing Seismic-type load pattern with ASCE 7-16 auto seismic
load assignment

nDir

    Type: SystemBoolean
This is an array with 6 inputs that indicates the seismic load directions

  1. nDir(1) = True = X Dir
  2. nDir(2) = True = Y Dir
  3. nDir(3) = True = X Dir + Eccentricity
  4. nDir(4) = True = Y Dir + Eccentricity
  5. nDir(5) = True = X Dir - Eccentricity
  6. nDir(6) = True = Y Dir - Eccentricity

Eccen

    Type: SystemDouble
The eccentricity ratio that applies to all diaphragms

PeriodFlag

    Type: SystemInt32
This is 1, 2 or 3, indicating the time period option

  1. Approximate
  2. Program calculated
  3. User defined

CtType

    Type: SystemInt32
This is one of the following values. This item is used only when PeriodFlag is
1 or 2

  0. 0 = Ct = 0.028 (ft), x = 0.8
  1. 1 = Ct = 0.016 (ft), x = 0.9
  2. 2 = Ct = 0.03 (ft), x = 0.75
  3. 3 = Ct = 0.02 (ft), x = 0.75

UserT

    Type: SystemDouble
The user specified time period. This item is meaningful when the PeriodFlag
item is 3. [s]

UserZ

    Type: SystemBoolean
This item is not used in ETABS

TopZ

    Type: SystemDouble
The global Z-coordinate at the highest level where auto seismic loads are
applied. [L]

BottomZ

    Type: SystemDouble
The global Z-coordinate at the lowest level where auto seismic loads are
applied. [L]

R

    Type: SystemDouble
The response modification factor

Omega

    Type: SystemDouble
The system overstrength factor

Cd

    Type: SystemDouble
The deflection amplification factor

I

    Type: SystemDouble
The occupancy importance factor

Ss

    Type: SystemDouble
The seismic coefficients Ss

S1

    Type: SystemDouble
The seismic coefficients S1

TL

    Type: SystemDouble
The long-period transition period. [s]

SiteClass

    Type: SystemInt32
This is 1, 2, 3, 4, 5 or 6, indicating the site class

  1. A
  2. B
  3. C
  4. D
  5. E
  6. F

Fa

    Type: SystemDouble
The site coefficients Fa

Fv

    Type: SystemDouble
The site coefficients Fv

#### Return Value

Type: Int32
returns zero if the function is successfully retrieved; otherwise it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()

       'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
       ret = EtabsObject.ApplicationStart()

       'create SapModel object
       SapModel = EtabsObject.SapModel

       'initialize model
       ret = SapModel.InitializeNewModel()

       'create steel deck template model
       ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

       'add new load pattern
       ret = mySapModel.LoadPatterns.Add("EQX", eLoadPatternType.Quake)

       'assign ASCE716 parameters
       Dim nDir() As Boolean
       Dim Eccen As Double
       Dim PeriodFlag As Long
       Dim CtType As Long
       Dim UserT As Double
       Dim UserZ As Boolean
       Dim TopZ As Double
       Dim BottomZ As Double
       Dim R As Double
       Dim Omega As Double
       Dim Cd As Double
       Dim I As Double
       Dim SS As Double
       Dim S1 As Double
       Dim TL As Double
       Dim SiteClass As Long
       Dim Fa As Double
       Dim Fv As Double

       ReDim nDir(6)
       nDir(1) = True
       nDir(2) = False
       nDir(3) = True
       nDir(4) = False
       nDir(5) = True
       nDir(6) = True
       TopZ = 32
       BottomZ = 14
       'set ASCE716 parameters
       ret = mySapModel.LoadPatterns.AutoSeismic.SetASCE716("EQX", nDir, 0.04, 3, 1, 1.76, False, TopZ, BottomZ, 6, 3.5, 6.5, 1.5, 1.9, 1.1, 8, 3, 0, 0)

       'get ASCE716 parameters
       ret = mySapModel.LoadPatterns.AutoSeismic.GetASCE716("EQX", nDir, Eccen, PeriodFlag, CtType, UserT, UserZ, TopZ, BottomZ, R, Omega, Cd, I, SS, S1, TL, SiteClass, Fa, Fv)

       'close ETABS
       EtabsObject.ApplicationExit(False)

       'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
       End Sub

See Also

#### Reference

cAutoSeismic Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com